tutorials/AMB2018-02-B-nLight/constant/scanPath
Mode    X       Y       Z   Power   Param
1       0.000   0.000   0   0       0
0       0.002   0.000   0   179.2   0.8
